const getMonthLength = (date) => {
  return parseInt((new Date().getTime() - new Date(date).getTime())/(1000 * 60 * 60 * 24 * 30)) + 1
}

export default [
  {
    type: 3,
    industry: "高级研发工程师",
    time: `20201203-至今(${getMonthLength('2020/12/03')}个月)`,
    ca: "互联网/出行类",
    hide: true,
    work: [
      "负责快的新出租小程序的维护以及日常功能交付",
      "快的新出租小程序整体优化（代码体积、组件、组件库等）",
      "推动项目进度，把控研发风险",
      "开发团队使用脚手架",
    ],
    money: "保密",
  },
  {
    type: 2,
    industry: "开发工程师",
    time: "20200701-20201130",
    ca: "互联网/办公系统相关",
    work: [
      "财务、费控等项目开发，考勤、差旅项目的维护",
      "脚手架开发（基于个人添加react模版、添加邮件通知、添加plop自动化配置）",
      "接口文档YAPI的搭建部署，投入使用（使用node+mongodb+pm2+nginx）",
      "学习electron，输出demo",
      "加深技术栈的深度",
    ],
    money: "保密",
  },
  {
    type: 1,
    industry: "软件开发工程师-前端",
    time: "20180705-20200619",
    ca: "互联网/智慧校园",
    work: [
      "制订相关学习体系，并且自我学习",
      "根据公司UED规范完成前端设计规范网站并开发满足公司的业务需求的脚手架",
      "前端H5转发代理服务器维护",
      "多级公文（web端、移动端）开发",
      "内控系统（web端、移动端）开发",
      "工作流系统（web端、移动端）开发",
      "表单设计器的维护和添加新功能",
      "工作流引擎的维护",
    ],
    money: "保密",
  },
];
